app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "foobar"], ["body", "foobar barfoo"], ["created_at", 2016-12-30 15:31:49 UTC], ["updated_at", 2016-12-30 15:31:49 UTC], ["user_id", 1]]
---
  def create
  @post = Post.new(post_params)
  @post.user_id = current_user.id
  @post.save